<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2015</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ben Goodstein</string>
      <key>Email</key>
      <string>ben.goodstein at it.ox.ac.uk</string>
      <key>Github</key>
      <string>fuzzylogiq</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the latest version of Reflector 2</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.Reflector2</string>
  <key>Input</key>
  <dict>
    <key>DOWNLOAD_URL</key>
    <string>https://www.airsquirrels.com/reflector/download/</string>
    <key>DOWNLOAD_REGEX</key>
    <string>https://download\.airsquirrels\.com/Reflector2/Mac/Reflector-2.*?\.dmg</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.5.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>re_pattern</key>
        <string>%DOWNLOAD_REGEX%</string>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
	  <key>Arguments</key>
	  <dict>
		<key>filename</key>
		<string>Reflector2.dmg</string>
		<key>url</key>
		<string>%match%</string>
	  </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
	  <key>Processor</key>
	  <string>CodeSignatureVerifier</string>
	  <key>Arguments</key>
	  <dict>
		<key>input_path</key>
		<string>%pathname%/Reflector 2.app</string>
		<key>requirement</key>
		<string>anchor apple generic and identifier "com.squirrels.Reflector-2" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "67X2M9MT5G")</string>
	  </dict>
	</dict>
  </array>
</dict> 
</plist>
