<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2015</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Gary Ballantine</string>
      <key>Email</key>
      <string>gary.ballantine at it.ox.ac.uk</string>
      <key>Github</key>
      <string>AltMeta</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current version of Eyefi Mobi Desktop</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.EyefiMobiDesktop</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Eyefi_Mobi_Desktop</string>
    <key>BASE_URL</key>
    <string>https://download.eyefi.com</string>
    <key>PKG_URL</key>
    <string>%BASE_URL%/mobi-osx/Eyefi%20Mobi.pkg</string>
    <key>USER_AGENT</key>
    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_4) AppleWebKit/600.7.12 (KHTML, like Gecko) Version/8.0.7 Safari/600.7.12</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
	<string>%NAME%.pkg</string>
	<key>request_headers</key>
	<dict>
	  <key>user-agent</key>
	  <string>%USER_AGENT%</string>
        </dict>
	<key>url</key>
	<string>%PKG_URL%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict> 
</plist>
