<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2018</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of Google Cloud SDK</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.Google_Cloud_SDK</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Google_Cloud_SDK</string>
    <key>BASE_URL</key>
    <string>https://cloud.google.com/sdk/docs/quickstart-macos</string>
    <key>PKG_SEARCH_PATTERN</key>
    <string>href="(?P&lt;pkgurl&gt;http[^"]+-darwin-x86_64.tar.gz)"</string>
    <key>VERSION_SEARCH_PATTERN</key>
    <string>&lt;h2[^\&gt;]+version\s(?P&lt;version&gt;[0-9\.]{2,})</string>
  </dict>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%VERSION_SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%PKG_SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%pkgurl%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
